{"id":155165,"date":"2018-10-02T16:00:01","date_gmt":"2018-10-02T15:00:01","guid":{"rendered":"https:\/\/coscharisgroup.net\/?p=155165"},"modified":"2018-10-02T16:00:01","modified_gmt":"2018-10-02T15:00:01","slug":"coscharis-celebrates-customer-service-appreciation-week-2018","status":"publish","type":"post","link":"https:\/\/coscharisgroup.net\/coscharis-celebrates-customer-service-appreciation-week-2018","title":{"rendered":"COSCHARIS CELEBRATES CUSTOMER SERVICE APPRECIATION WEEK 2018"},"content":{"rendered":"<p>In the spirit of this year’s Customer Service Week theme: “Excellence Happens Here”, Coscharis Motors has set up customer-centric activities from October 1 to 5, 2018 at all of her branches nationwide to recognize and celebrate all her brands’ customers.<\/p>\n<p>According to Abiona Babarinde, the General Manager, Marketing and Corporate Communications for the Group, ‘Our focus this year is twofold – to visit the customers in their respective business environment and welcome those who visit our business within this period.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<\/p>\n<p>For Coscharis Motors, the motivation is to bond with our existing customers both happy and dissatisfied. We are specially targeting the latter given our revitalized service capacity aimed at sustaining value for money.<\/p>\n<p>Importantly, we are offering all customers 10% discount for repairs and parts during the customer week across all our branches in Nigeria.<\/p>\n<p>As a global practice, we are also celebrating our staff that serve and support our customers on a daily basis. The week-long activity is geared towards motivating them to always treat the customer as king or queen; meaning the customer has every right to be listened to and respected. Every complaint should be viewed as a privilege, evaluated and rectified with appropriate action(s).<\/p>\n<p>He remarked that “exhibiting excellent Customer Care delivery drives any business success in the long term.<\/p>\n<p>In addition, he stated that the customer service week avails Coscharis the chance, as a customer &#8211; focused business, a week-long opportunity to raise further awareness among the staff on customer service and the vital role it plays in successful business practice.<\/p>\n<p>The Executive Director, Aftersales, Cosmas Jr. Maduka enthused that the company must use this Customer Service Week to re-assess how easy it is to make our customers satisfied and loyal and be willing to go the extra mile; as the ways we deal with challenges are as important for customers as the eventual outcome.<\/p>\n<p>Coscharis Motors as the sole importer of BMW, Jaguar Land Rover, MG and a franchise dealer of Ford in Nigeria offers a comprehensive warranty backed by a region-wide service network responsible for the provision of world-class maintenance and parts back-up. Call or visit any of our offices to book a test drive or make further enquiries.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In the spirit of this year’s Customer Service Week theme: “Excellence Happens Here”, Coscharis Motors has set up customer-centric activities from October 1 to 5, 2018 at all of her branches nationwide to recognize and celebrate all her brands’ customers. According to Abiona Babarinde, the General Manager, Marketing and Corporate Communications for the Group, ‘Our [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"om_disable_all_campaigns":false,"ngg_post_thumbnail":0},"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/155165"}],"collection":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/comments?post=155165"}],"version-history":[{"count":2,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/155165\/revisions"}],"predecessor-version":[{"id":155167,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/155165\/revisions\/155167"}],"wp:attachment":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/media?parent=155165"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/categories?post=155165"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/tags?post=155165"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}