{"id":161,"date":"2016-06-21T09:02:12","date_gmt":"2016-06-21T09:02:12","guid":{"rendered":"http:\/\/localhost\/coscharis\/?p=161"},"modified":"2016-06-21T09:02:12","modified_gmt":"2016-06-21T09:02:12","slug":"coscharis-mobility-sixt-nigeria-bags-sixt-glory-2015-international-award-in-monaco","status":"publish","type":"post","link":"https:\/\/coscharisgroup.net\/coscharis-mobility-sixt-nigeria-bags-sixt-glory-2015-international-award-in-monaco","title":{"rendered":"COSCHARIS MOBILITY-SIXT NIGERIA BAGS SIXT GLORY 2015 INTERNATIONAL AWARD IN MONACO"},"content":{"rendered":"<p>Coscharis Mobility-SIXT Nigeria, a subsidiary of Coscharis Group, has emerged as the clear winner of this year’s SIXT GLORY 2015 Award at the just concluded SIXT annual conference in Monaco.<\/p>\n<p>According to Christian Chigbundu, General Manager\/CEO, Coscharis Mobility-Sixt Nigeria, “the award was based on the company’s performance in the last two years of operations.” The criteria utilized for the award included:<\/p>\n<ul>\n<li>The fastest organized franchise within 2 years of operation<\/li>\n<li>The first franchise to do Corporate Social Responsibility (CSR) with Regina Sixt Dry Little tears without using an NGO<\/li>\n<li>The first franchise to organize customer appreciation activity.<\/li>\n<\/ul>\n<p>This is the first time any African franchise will be winning an award in the history of SIXT Rental Company International.<\/p>\n<p>In addition, SIXT Nigeria had worn the Best Car Rental Company of Year 2015 at the recently held Nigeria Auto Journalist Award, NAJA in Lagos in recognition for the structure and quality of its chauffeur service in Nigeria.<\/p>\n<p>Sixt Nigeria offers a wide range of chauffeur driven cars including premium and non-premium variants depending on demands. It range of cars include Royce Rolls, BMW, Jaguar Land Rover, Ford and Morris Garages models. Since its two years of operation, it has set itself apart as a clear leader in the auto rental segment in Nigeria and competes favourably with any existing car rental in Nigeria and Africa.<\/p>\n<p>We are currently expanding to complement our existing network in Lagos, Abuja and Port Harcourt in order to create a wide point of contact across Nigeria. The company also consistently takes due account of today’s mobility requirements and is expanding its services with modern online and mobile solutions according to demand.<\/p>\n<p>Our focus is to continuously plan to enable our customers to consistently access high-quality rental services and enjoy our premium services negotiated in their favours.<\/p>\n<p><strong>About Sixt Nigeria<\/strong><\/p>\n<p>Sixt Nigeria, registered as Coscharis Mobility, a subsidiary of Coscharis Group, is a leading national provider of high-quality mobility services for business and corporate customers as well as private travellers. The company’s strengths lie in the high proportion of premium cars in the vehicle fleet, its employees’ consistent service orientation paired with a good price-performance ratio. Taken together these strengths have given the recently acquired franchise a unique market position.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Coscharis Mobility-SIXT Nigeria, a subsidiary of Coscharis Group, has emerged as the clear winner of this year’s SIXT GLORY 2015 Award at the just concluded SIXT annual conference in Monaco. According to Christian Chigbundu, General Manager\/CEO, Coscharis Mobility-Sixt Nigeria, “the award was based on the company’s performance in the last two years of operations.” The [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"om_disable_all_campaigns":false,"ngg_post_thumbnail":0},"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/161"}],"collection":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/comments?post=161"}],"version-history":[{"count":0,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/161\/revisions"}],"wp:attachment":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/media?parent=161"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/categories?post=161"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/tags?post=161"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}