{"id":187429,"date":"2019-05-10T18:05:46","date_gmt":"2019-05-10T17:05:46","guid":{"rendered":"https:\/\/coscharisgroup.net\/?p=187429"},"modified":"2019-05-16T10:01:48","modified_gmt":"2019-05-16T09:01:48","slug":"coscharis-motors-unveils-the-new-ford-everest-at-the-lagos-international-motor-show","status":"publish","type":"post","link":"https:\/\/coscharisgroup.net\/coscharis-motors-unveils-the-new-ford-everest-at-the-lagos-international-motor-show","title":{"rendered":"COSCHARIS MOTORS UNVEILS THE NEW FORD EVEREST AT THE LAGOS INTERNATIONAL MOTOR FAIR"},"content":{"rendered":"\n<ul><li>Coscharis Motors debuts the new Ford Everest to the Nigerian market <\/li><\/ul>\n\n\n\n<ul><li>2019 Ford Everest delivers refreshed design, more luxurious interior, improved comfort and luxury on XLT series<\/li><\/ul>\n\n\n\n<ul><li>Updated suspension configuration delivers greater ride refinement, better steering precision and control<\/li><\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p><strong>LAGOS, NIGERIA<\/strong><strong>, 08 May 2019 <\/strong>– Coscharis Motors, exclusive distributor of Ford vehicles in Nigeria, will be unveiling the new Everest XLT Range and Everest Limited at the Lagos International Motor Show. The show, is in its 14<sup>th<\/sup> year, and will be held from 6 to 11 May in Lagos, Nigeria. <\/p>\n\n\n\n<p>The new Ford Everest is the most sophisticated Everest seven-seater sport utility vehicle (SUV) on the market. It is more appealing than ever with a range of styling, suspension and feature upgrades. As Ford’s premium offering in the rapidly growing SUV market, the New Everest puts the emphasis on quality, refinement and luxury matched to exceptional space and practicality.<\/p>\n\n\n\n<p>“We are excited the new Everest will be joining our local line-up. The new Everest will provide Ford an important position in the SUV segment, it is a segment which continues to grow in Africa, as well as around the world. Consumers are opting for versatile, family-oriented vehicles that suit their active lifestyles,” says Abiona Babarinde, GM of Marketing and Communications at Coscharis Motors. &nbsp;<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img loading=\"lazy\" width=\"1024\" height=\"683\" src=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2019\/05\/H-1024x683.jpg\" alt=\"\" class=\"wp-image-187612\" srcset=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2019\/05\/H-1024x683.jpg 1024w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2019\/05\/H-300x200.jpg 300w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2019\/05\/H-768x512.jpg 768w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2019\/05\/H.jpg 1080w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure><\/div>\n\n\n\n<p>“With the New Everest, we have raised the game even further by introducing subtle yet effective styling updates with the eye-catching exterior, providing a more refined and luxurious cabin environment, adding several new trend-setting technologies to the already feature-packed range, and building on the outgoing model’s superb comfort and ride refinement with a revised suspension set-up. More so, the Everest comes in diesel engines, which is what some of our oil services customers have been yearning for, as it is more ideal for access into highly inflammable locations than its petrol counterpart.”<\/p>\n\n\n\n<p><strong>Refreshed design emphasises exclusivity and capability<\/strong><\/p>\n\n\n\n<p>The New Everest communicates rugged off-road capability with a sense of refined artistry that takes Ford’s seven-seater SUV to a new level within the segment. The refreshed grille introduces a new level of depth to the design through the layering of three distinctive grille bars that exude exclusivity and luxury whilst presenting a sense of strength and robustness.<\/p>\n\n\n\n<p>The lower bumper has been redesigned to accentuate width, incorporating a connected horizontal beam that has been added to the fascia insert, which gives the Everest even greater on-road presence.<\/p>\n\n\n\n<p>A classy new 20-inch wheel has been introduced on the range-topping Everest Limited, featuring a modern split spoke design that gives the vehicle a more upmarket and dynamic appearance.<\/p>\n\n\n\n<p>Ford has also upped the ante in terms of overall quality and refinement, employing a more purposeful execution of colours and materials. Stronger contrasting elements are employed with the addition of the secondary grille texture against the chrome bright work.<\/p>\n\n\n\n<p>The accents move from a single-layer satin metallic to a two-layer glossy metallic paint, giving a more liquid-like feel for customers expecting outstanding quality. The wheel accent paints are now darker to further accentuate the machine-cut surface of the alloys, adding more drama and a more premium look to the overall appearance.<\/p>\n\n\n\n<p>A new exterior body colour has been added to the line-up: Diffused Silver is designed as a modern take on the typical luxury beige. It communicates toughness with its added depth and also sophistication with its smooth champagne highlights.<\/p>\n\n\n\n<p><strong>Exceptional quality and refinement<\/strong><\/p>\n\n\n\n<p>The New Everest provides premium levels of quality, outstanding interior space and maximum versatility – now with a selection of new, richer materials and design details that emphasise luxury and style throughout.<\/p>\n\n\n\n<p>The introduction of the Ebony environment colour changes the entire ambience of the interior cabin. The added depth allows the details and bright work to stand out and further aligns the interior to the customer’s expectation for a premium SUV, complemented by a greater selection of soft-touch materials.<\/p>\n\n\n\n<p>Adding further exclusivity to the cabin is the use of contrast stitching on the Everest Limited, along with shadow chrome finishes, perforated leather and high-quality paints that add further lustre to the upgraded interior.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" width=\"1024\" height=\"683\" src=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2019\/05\/J-1024x683.jpg\" alt=\"\" class=\"wp-image-187611\" srcset=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2019\/05\/J-1024x683.jpg 1024w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2019\/05\/J-300x200.jpg 300w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2019\/05\/J-768x512.jpg 768w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2019\/05\/J.jpg 1080w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p><strong>Proven 2.2 and 3.2-litre Duratorq TDCi performance<\/strong><\/p>\n\n\n\n<p>The current 2.2-litre Duratorq TDCi engine, with 118kW and 385Nm, is available in the Everest XLT derivatives, with a choice of six-speed manual or automatic derivatives. An electronic differential lock is standard across the Everest range to enhance off-road capability.<\/p>\n\n\n\n<p>Customers also have the option of the powerful 3.2-litre five-cylinder TDCi engine on the XLT model with 147kW and 470Nm on tap, matched to a six-speed automatic transmission and four-wheel drive. <\/p>\n\n\n\n<p>All Everest 4&#215;4 models are equipped with Ford’s seamless and intuitive Terrain Management System that facilitates easy switching between Normal, Rock Crawl, Mud and Sand modes to suit the driving conditions.<\/p>\n\n\n\n<p><strong>Improved ride comfort and refinement<\/strong><\/p>\n\n\n\n<p>As with the New Ford Ranger, the New Everest has benefited from numerous suspension improvements that further enhance ride quality and refinement. Most notably, the front-mounted stabiliser bar has been moved to the rear of the front axle, which allows for greater packaging and design freedom, along with an increase in diameter and stiffness to give the Everest improved roll control and handling performance.<\/p>\n\n\n\n<p>The revised layout has also enabled a reduction in front spring rates, thus achieving an even more comfortable and pliant ride. Additionally, the jounce bumper, which softens the impact when the suspension is fully compressed over severe bumps, has been relocated from the lower control arm to the damper rod at the top of the suspension, thereby reducing the load on the suspension bushes. This gives an improved ride and reduced noise levels. <\/p>\n\n\n\n<p>Overall suspension compliance has been improved, with three damper tunes being adopted for the New Everest range in place of the single set-up used previously. This ensures that the ride characteristics are better tailored to the engine and drivetrain configurations, resulting in a plusher ride over rough surfaces without impacting the Everest’s maximum towing capacity of 3&nbsp;000kg with a braked trailer.<\/p>\n\n\n\n<p>The extensive suspension refinements have also enabled a reduction in tyre pressures from 240 to 210 kPa, further enhancing overall comfort and isolating the occupants from road imperfections. At the same time, steering precision and control has also been improved.<\/p>\n\n\n\n<p><strong>Technology and safety<\/strong><\/p>\n\n\n\n<p>A new addition to the Everest’s impressive range of high-tech features is the Passive Entry and Passive Start (PEPS) system, fitted as standard on the XLT and Limited models. The keyless entry and passive start uses an intelligent access system that allows the driver to unlock the vehicle and start the engine without removing the key fob from their pocket or bag. When the key is in the vehicle, the driver simply presses the Start\/Stop button while applying the brake pedal to start the car.<\/p>\n\n\n\n<p>The Everest Limited continues to set the benchmark for active driving features, including Semi-Automatic Parallel Park Assist (SAPPA) that uses ultrasonic sensors on the front and rear bumpers to search for and identify parking spaces that are big enough to parallel park the vehicle. A combination of the Everest’s electric power-assisted steering (EPAS) and sensors are used to steer the vehicle safely and perfectly into place, while the driver simply operates the gears, accelerator and brake.<\/p>\n\n\n\n<p>Additional standard appointments on the Limited include Adaptive Cruise Control with Forward Collision Alert (which now recognises pedestrians, in addition to its ability to detect other vehicles), Lane Keeping Aid and Lane Departure Warning, Blind Spot Information System with cross-traffic alert, Tyre Pressure Monitoring System (TPMS) and &nbsp;Auto High Beam Control for the high intensity discharge (HID) headlamps.<\/p>\n\n\n\n<p>The impressive standard safety package across the line-up extends to Electronic Stability Control (ESC) system with Traction Control (TC), Trailer Sway Control (TSC), Hill Start Assist (HSA), Hill Descent Control (HDC) on the 4&#215;4 models, Load Adaptive control (LAC) and Roll Over Mitigation (ROM).<\/p>\n\n\n\n<p>A full Category 1 Thatcham-specification alarm is now standard on all Everest XLT and Limited models for enhanced anti-theft security.<\/p>\n\n\n\n<p><strong>SYNC<\/strong><strong><sup>®<\/sup><\/strong><strong> infotainment system<\/strong><\/p>\n\n\n\n<p>Ford’s pioneering SYNC<sup>®<\/sup> technology offers exceptional connectivity and multimedia options, along with intuitive voice control and ease of use. SYNC<sup>®<\/sup>3 with Navigation is standard on the Everest Limited model, linked to the integrated eight-inch touch-screen colour display, two USB ports and Bluetooth connectivity.<\/p>\n\n\n\n<p>The system boasts fully-featured embedded navigation, convenient multi-touch gestures (such as swipe, slide, scroll and pinch-to-zoom), plus voice recognition that uses simple, real-world voice commands.<\/p>\n\n\n\n<p>SYNC<sup>®<\/sup>3 with Navigation provides a full 3D experience with an elevated map view, enhanced full colour graphics and point of interest (POI) building images. Similar to searching on Google, destinations can be entered via the simple one-box search by typing the address, POI category, intersection, city name, post code or GPS coordinates. The search function is predictive, with results appearing as the information is typed. Voice commands can also be used to select a POI.<\/p>\n\n\n\n<p>Tracks4Africa is included in the package, as well as access to maps for over 20 countries in Africa. Free annual map updates are included for a period of five years, and the text and voice guidance functions are available in a multitude of languages, comprising Afrikaans, Arabic, English, French, German, Italian, Portuguese, Spanish and isiZulu. <\/p>\n\n\n\n<p>SYNC<sup>®<\/sup>3 also offers the benefits of smartphone integration provided through Apple CarPlay or Android Auto, which transforms the phone’s connectivity with the car. Through Apple CarPlay, SYNC<sup> <\/sup>3 can be used to access Siri, make calls, return missed calls and listen to voice mail, as well as send, read and reply to text messages. Songs, playlists and compatible apps like Apple Maps, can also be accessed. Similar functionality is provided with Android Auto, with the Google platform used to interact with the phone, and access apps such as Google Maps. Waze users can now project the app’s real-time traffic and navigation service onto the touch screen in Ford vehicles via SYNC<sup>®<\/sup>3 AppLink<sup>®<\/sup>&nbsp;and control it through voice command.<\/p>\n\n\n\n<p>To keep the system up to date, periodic wireless software updates for SYNC<sup>®<\/sup>3 can be downloaded via Wi-Fi, or manually, once it is set up on a trusted wireless network. <\/p>\n\n\n\n<p>The Everest XLT come standard with Ford’s SYNC<sup>®<\/sup> 1 system with Bluetooth voice control and audio streaming, a 4.2-inch colour screen, as well as USB and Aux ports.<br><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Coscharis Motors debuts the new Ford Everest to the Nigerian market 2019 Ford Everest delivers refreshed design, more luxurious interior, improved comfort and luxury on XLT series Updated suspension configuration delivers greater ride refinement, better steering precision and control LAGOS, NIGERIA, 08 May 2019 – Coscharis Motors, exclusive distributor of Ford vehicles in Nigeria, will [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"om_disable_all_campaigns":false,"ngg_post_thumbnail":0},"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/187429"}],"collection":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/comments?post=187429"}],"version-history":[{"count":4,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/187429\/revisions"}],"predecessor-version":[{"id":187613,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/187429\/revisions\/187613"}],"wp:attachment":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/media?parent=187429"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/categories?post=187429"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/tags?post=187429"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}