{"id":188270,"date":"2019-07-10T12:00:57","date_gmt":"2019-07-10T11:00:57","guid":{"rendered":"https:\/\/coscharisgroup.net\/?p=188270"},"modified":"2019-07-10T12:00:57","modified_gmt":"2019-07-10T11:00:57","slug":"groupe-renault-and-coscharis-group-start-new-partnership-in-nigeria","status":"publish","type":"post","link":"https:\/\/coscharisgroup.net\/groupe-renault-and-coscharis-group-start-new-partnership-in-nigeria","title":{"rendered":"GROUPE RENAULT AND COSCHARIS GROUP START NEW PARTNERSHIP IN NIGERIA"},"content":{"rendered":"\n<figure class=\"wp-block-image\"><img loading=\"lazy\" width=\"1024\" height=\"85\" src=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2019\/07\/Renault-Coscharis-logo-1024x85.jpg\" alt=\"\" class=\"wp-image-188272\" srcset=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2019\/07\/Renault-Coscharis-logo-1024x85.jpg 1024w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2019\/07\/Renault-Coscharis-logo-300x25.jpg 300w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2019\/07\/Renault-Coscharis-logo-768x64.jpg 768w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2019\/07\/Renault-Coscharis-logo.jpg 1058w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<ul><li><strong>Renault\nreturns back to Nigeria! <\/strong><\/li><\/ul>\n\n\n\n<p><strong>• Groupe Renault and Coscharis Group start local\nassembly in Nigeria<\/strong><\/p>\n\n\n\n<ul><li><strong>The Coscharis Motor\nAssembly plant will assemble Renault Logan and Renault Duster and will\ndistribute the vehicles through their sales network throughout the country.<\/strong><\/li><\/ul>\n\n\n\n<p><strong>• Groupe Renault is leader in Africa with 18% market\nshare.<\/strong><\/p>\n\n\n\n<p>Automobile enthusiasts in Nigeria are about to get fired up\nand live their passion once again as the renowned French automobile brand,\nRenault, makes a return to the country. &nbsp;Precisely\non the 18<sup>th<\/sup> of July 2019, Renault will make a giant stride back into\nthe Nigeria market, however, this time around, it will be led into the market\nby Nigeria’s foremost automobile dealership, Coscharis Motors Plc, one of the\nsubsidiaries of the Coscharis Group.<\/p>\n\n\n\n<p>To kick start this strong\ncooperation which involves both local production and distribution, two of the\nRenault variants namely Logan and Duster will be assembled in the existing\nCoscharis Assembly facility in Lagos. Additionally, Renault Kwid and Renault\nOroch will be imported as Complete Built Unit (CBU) in due course of the\npartnership.<\/p>\n\n\n\n<p><em>“With a population of over\n200 million, Nigeria is a strategic African country where Groupe Renault will\nextend its footprint. The Coscharis Group is a recognized player in car\n(vehicle) assembly and distribution.&nbsp;\nThanks to their expertise and our products adapted to the local needs,\nwe will be able to answer immediately to the customers’ demand in Nigeria<\/em>”\nsaid Fabrice Cambolive, SVP and Chairman of the Africa, Middle-East India\nregion of Groupe Renault.<\/p>\n\n\n\n<p>Groupe Renault is leading the\nAfrican continent with an 18% market share. In 2018, Groupe Renault sold more\nthan 216 000 vehicles in Africa. The most important countries in sales volume\nare currently Morocco, Algeria, South Africa, Egypt. The group’s objective is\nto maintain its leadership within these countries and respond to the demand of\nthe new emerging middle class of the countries like Nigeria.<\/p>\n\n\n\n<p>Commenting on this new\nbusiness collaboration, the President \/ CEO of Coscharis Group, Dr. Cosmas\nMaduka said:<strong> ‘<\/strong><em>’this partnership is to showcase\nanother initiative from our great organization through one of our subsidiaries,\nCoscharis Motors, to further create value as a key player in the automobile\nindustry in Nigeria; we are glad to celebrate the confidence the renowned\nbrand, Renault reposed in us to represent them in Nigeria. This milestone marks\nanother step in the evolution of our organization towards remaining timeless in\nits relevance’’.<\/em><\/p>\n\n\n\n<p>According to Maduka, <em>this\npartnership is to further delight the esteemed loyal customers and prospects\nalike, especially towards providing them a bouquet of more options and value\nfor money.<\/em> In his words, ‘<em>’We are\ncommitted to broadening our dealership scope when such opportunity as this\nhappens, since it is a strategic opportunity to deliver capable, refined and cost-effective\nvehicle models to our ever loyal customers’’.<\/em> <\/p>\n\n\n\n<p>This new milestone achievement from Coscharis that is\nexpected to reshape the automobile industry in Nigeria will take place at the\nCoscharis Motors Assembly facility in Awoyaya, along Lekki-Epe Expressway,\nIbeju-Lekki, Lagos is expected to be witnessed by dignitaries from all walks of\nlife, including leadership from the three tiers of the government (both at\nFederal and State levels), members of the diplomatic corps, industry\nstakeholders and enthusiasts as well as the media. <\/p>\n\n\n\n<p><strong><br>\nAbout Coscharis Group<\/strong><strong><\/strong><\/p>\n\n\n\n<p><strong><br>\n<\/strong>Coscharis Group established in 1977 is a reputable wholly owned Nigerian\nconglomerate with interests in various sectors of the economy which include\nAutomobile, Information and communications technology, Logistics, Agriculture,\nFood &amp; Beverages, Properties, Health amongst others representing globally\nrespected iconic brands in Nigeria. The group has branches across Nigeria and\nin three West African countries. It presently has automobile sales and service\ndealerships in all the geo-political zones in Nigeria with 5 outlets in Lagos\nalone, which is the commercial nerve of the Nigerian economy.<\/p>\n\n\n\n<p>With the intent to support the growth\nof the Nigerian automotive industry in Nigeria, Coscharis Motors Assembly Ltd\n(CMAL) established in 2014, commenced assembling of vehicles and rolled out its\nfirst batch in November 2015.<\/p>\n\n\n\n<p><strong>About Groupe Renault<\/strong><\/p>\n\n\n\n<p>Groupe Renault has manufactured cars since 1898. Today it\nis an international multi-brand group, selling close to 3.9 million vehicles in\n134 countries in 2018, with 36 manufacturing sites, 12,700 points of sales and\nemploying more than 180,000 people.<\/p>\n\n\n\n<p>To address the major technological challenges of the\nfuture, while continuing to pursue its profitable growth strategy, Groupe\nRenault is focusing on international expansion. To this end, it is drawing on\nthe synergies of its five brands (Renault, Dacia, Renault Samsung Motors,\nAlpine and LADA), electric vehicles, and its unique alliance with Nissan and\nMitsubishi Motors. With a 100% Renault owned team committed to the Formula 1\nWorld Championship since 2016, the brand is involved in motorsports, a real\nvector for innovation and awareness.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Renault returns back to Nigeria! • Groupe Renault and Coscharis Group start local assembly in Nigeria The Coscharis Motor Assembly plant will assemble Renault Logan and Renault Duster and will distribute the vehicles through their sales network throughout the country. • Groupe Renault is leader in Africa with 18% market share. Automobile enthusiasts in Nigeria [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"om_disable_all_campaigns":false,"ngg_post_thumbnail":0},"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/188270"}],"collection":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/comments?post=188270"}],"version-history":[{"count":3,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/188270\/revisions"}],"predecessor-version":[{"id":188274,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/188270\/revisions\/188274"}],"wp:attachment":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/media?parent=188270"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/categories?post=188270"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/tags?post=188270"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}