{"id":197713,"date":"2020-01-02T12:36:16","date_gmt":"2020-01-02T11:36:16","guid":{"rendered":"https:\/\/coscharisgroup.net\/?p=197713"},"modified":"2020-01-02T12:36:16","modified_gmt":"2020-01-02T11:36:16","slug":"award-galore-for-coscharis-brand","status":"publish","type":"post","link":"https:\/\/coscharisgroup.net\/award-galore-for-coscharis-brand","title":{"rendered":"AWARD GALORE FOR COSCHARIS BRAND"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Coscharis Group through one of its subsidiaries, Coscharis Motors representing some respected iconic auto brands in Nigeria ended the year with recognition awards on some of its brands and personnel. It was a glorious day for the leading auto dealer giant, Coscharis Motors at the recently held award event organized by the Nigerian Auto Journalists Association at the Eko Hotels and Towers, Lagos. The automobile company carted home two awards with the <\/span><b><i>Range Rover Autobiography winning the Luxury SUV of the year award <\/i><\/b><span style=\"font-weight: 400;\">while the <\/span><b><i>General Manager, Marketing and Corporate Communications, Abiona Babarinde was also recognized as the Media \/ PR Manager of the Year award <\/i><\/b><span style=\"font-weight: 400;\">respectively.<img loading=\"lazy\" class=\"size-large wp-image-197714 alignright\" src=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2020\/01\/IMG_4533-963x1024.jpg\" alt=\"\" width=\"640\" height=\"681\" srcset=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2020\/01\/IMG_4533-963x1024.jpg 963w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2020\/01\/IMG_4533-282x300.jpg 282w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2020\/01\/IMG_4533-768x817.jpg 768w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2020\/01\/IMG_4533.jpg 1067w\" sizes=\"(max-width: 640px) 100vw, 640px\" \/><\/span><\/p>\n<p><span style=\"font-weight: 400;\">The award for the luxury SUV category was keenly contested with other tested luxury brands but the Range Rover Autobiography came tops according to the organizers after strong consideration of the market acceptance of the Range Rover Autobiography in all ramifications. The Range Rover Autobiography variant has its special appeal and style that resonates with its priority audience when it comes to class, comfort and performance. Presenting the award to Mr. Abiona Babarinde who represented Coscharis Group at the event, the Assistant Corp Marshal, Federal Road Safety Corps, Mr Samuel Obayemi who stood in for the Corp Marshal of the FRSC, Dr. Boboye Oyeyemi, equally applauded the choice of the Range Rover Autobiography as the winning brand in this category as he confirmed that it is revolutionary, reliable and a class on its own when it comes to luxury in the Sport Utility Vehicle segment. He equally commended Coscharis Motors for maintaining the global standard of positioning the brand overtime to the ever dynamic Nigerian market as the sole franchisee of the Jaguar LandRover brand in Nigeria.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Likewise, Coscharis Motors&#8217; efforts in the luxury segment of the automobile industry was duly recognized at another award event organized by The Nigerian Automotive Industry Award where the <\/span><b><i>Jaguar XJ was awarded the Luxury Car of the Year.<\/i><\/b><span style=\"font-weight: 400;\">&nbsp;<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Commenting on these awards, the expectedly elated President of Coscharis Group, Dr. Cosmas Maduka dedicated the awards to the organization’s ever loyal customers for their consistence patronage and acceptance of the brands over the years with a promise to continually create more value in the automobile industry in Nigeria across board. In his words, &#8216;’there can&#8217;t be another best way to end a very challenging business year in 2019 than with these set of prestigious awards as recognition to some hard work made possible by our hard working team members across board who despite all odds has consciously strive to deliver value for money at all times for the benefit of our numerous stakeholders. We do cherish all these awards that came our way especially coming from the ever conscious and professional media partners that has been part of the success story of the Coscharis brand from the beginning in Nigeria and beyond’’.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The ever exciting annual NAJA award ceremony that usually brings stakeholders in the automobile industry together under one roof expectedly lived up to its billings with industry players from both the private and public sectors fully represented.&nbsp;<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Coscharis Group through one of its subsidiaries, Coscharis Motors representing some respected iconic auto brands in Nigeria ended the year with recognition awards on some of its brands and personnel. It was a glorious day for the leading auto dealer giant, Coscharis Motors at the recently held award event organized by the Nigerian Auto Journalists [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"om_disable_all_campaigns":false,"ngg_post_thumbnail":0},"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/197713"}],"collection":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/comments?post=197713"}],"version-history":[{"count":1,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/197713\/revisions"}],"predecessor-version":[{"id":197715,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/197713\/revisions\/197715"}],"wp:attachment":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/media?parent=197713"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/categories?post=197713"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/tags?post=197713"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}