{"id":199610,"date":"2020-03-30T13:44:42","date_gmt":"2020-03-30T12:44:42","guid":{"rendered":"https:\/\/coscharisgroup.net\/?p=199610"},"modified":"2020-03-30T13:45:39","modified_gmt":"2020-03-30T12:45:39","slug":"covid-19-coscharis-shuts-down-lagos-and-abuja-operations-in-line-with-the-federal-government-directive","status":"publish","type":"post","link":"https:\/\/coscharisgroup.net\/covid-19-coscharis-shuts-down-lagos-and-abuja-operations-in-line-with-the-federal-government-directive","title":{"rendered":"COVID – 19, COSCHARIS SHUTS DOWN LAGOS AND ABUJA OPERATIONS.……in line with the Federal government directive"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">As promised to continually update both all our internal and external stakeholders as we monitor new developments in relations to the Corona virus issues in the country, we hereby announce the immediate closure of all our operations in Lagos and Abuja respectively. This is strictly in line with the Federal government directives as officially announced by Mr. President, Muhammadu Buhari on Sunday 29 March, 2020 as part of the government’s measures to curtail further spread in both Lagos State and Abuja.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">While we shut down our offices in the two locations mentioned by 11.00pm on Monday 30 March, 2020 as directed by the Federal government, we encourage our customers to make use of other communication platforms earlier shared for any urgent and very important services that does not require physical visit to our offices as our relevant staff will try to attend to your enquires from their various homes where necessary via phone and emails.<\/span><\/p>\n<p><b>With the above pronouncement, the management has directed that work ends by 3.00pm today Monday March 30, 2020 to enable staff to equip themselves and their families during the stay at home period. Also, all staff in the two locations, i.e. Lagos State and Abuja are expected to stay in their various homes for the next 14 days from Tuesday March 31, 2020 while we await further directives from appropriate quarters. We shall continue to monitor developments in other states where we operate as we remain committed to adhering to all relevant authorities’ directives as a responsive and responsible organization especially to support all initiatives to put a total stop and eradicate this virus from our country.&nbsp;&nbsp;<\/b><\/p>\n<p><span style=\"font-weight: 400;\">More importantly at this time, we can’t over – emphasize the need for both our staff and all stakeholders alike to continue to follow all the necessary precautionary health measures as pronounced by the relevant government authorities to keep safe in this trying period of our time (reference to the attachment as a reminder).<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Coscharis group remains resolute that this corona virus that has been declared pandemic will be eradicated with the collective support of us all.&nbsp;<\/span><\/p>\n<p><b>STAY SAFE BUT DON’T PANIC!!<\/b><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As promised to continually update both all our internal and external stakeholders as we monitor new developments in relations to the Corona virus issues in the country, we hereby announce the immediate closure of all our operations in Lagos and Abuja respectively. This is strictly in line with the Federal government directives as officially announced [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"om_disable_all_campaigns":false,"ngg_post_thumbnail":0},"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/199610"}],"collection":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/comments?post=199610"}],"version-history":[{"count":1,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/199610\/revisions"}],"predecessor-version":[{"id":199612,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/199610\/revisions\/199612"}],"wp:attachment":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/media?parent=199610"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/categories?post=199610"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/tags?post=199610"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}