{"id":200527,"date":"2020-06-17T13:26:37","date_gmt":"2020-06-17T12:26:37","guid":{"rendered":"https:\/\/coscharisgroup.net\/?p=200527"},"modified":"2020-06-17T13:26:37","modified_gmt":"2020-06-17T12:26:37","slug":"dr-cosmas-maduka-joins-ey-world-entrepreneur-of-the-year-class-of-2020","status":"publish","type":"post","link":"https:\/\/coscharisgroup.net\/dr-cosmas-maduka-joins-ey-world-entrepreneur-of-the-year-class-of-2020","title":{"rendered":"DR COSMAS MADUKA JOINS EY WORLD ENTREPRENEUR OF THE YEAR CLASS OF 2020"},"content":{"rendered":"<p><strong>Sequel to Dr Cosmas Maduka’s emergence as the winner of Ernst &amp; Young Entrepreneur of the Year 2020 award for the West Africa region, he officially joined the “EY World Entrepreneur of the Year” Class of 2020 along with 46 other exceptional entrepreneurs from 41 countries across the globe.<\/strong><\/p>\n<p><img loading=\"lazy\" class=\"size-large wp-image-200528 alignleft\" src=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2020\/06\/ey-forza-1024x541.png\" alt=\"\" width=\"640\" height=\"338\" srcset=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2020\/06\/ey-forza-1024x541.png 1024w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2020\/06\/ey-forza-300x159.png 300w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2020\/06\/ey-forza-768x406.png 768w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2020\/06\/ey-forza.png 1602w\" sizes=\"(max-width: 640px) 100vw, 640px\" \/><\/p>\n<p>The global event, originally scheduled to hold as a live audience participatory event in Carlo, Monaco, held as a first ever live virtual EY award ceremony in partnership with CNBC due to the travel restrictions occasioned by the outbreak of Covid-19 pandemic across the world.<\/p>\n<p>The award is not only designed to celebrate and honour the contributions and achievements of successful entrepreneurs but also serves to inspire today’s successful entrepreneurs, so they can share their incredible entrepreneurial stories stated Ashish Bakhshi, Leader at EY (West Africa).<\/p>\n<p>While Dr. Kiran Mazumdar-Shaw from India, emerged the global stage award winner, Dr Maduka was acclaimed to have made the top list of the highest ranked award winners in EY’s People’s Choice with viewers reaching 1.7m across 124 countries and still growing as at the award day. According to Stasia Mitchell, Entrepreneurship Leader at EY (Global Growth Markets), “this was the first time we asked the people to vote on the award winner who most inspired them. The voting was meant to be a fun, engaging way to get to know the class of 2020 better”.<\/p>\n<p>He stated further it was no surprise that Dr Maduka and the Coscharis brand stood out so clearly. “This continues to show how inspiring you and your story are to so many around the world and it says a lot about how valuable your mission is. I can’t wait to meet you in person.”<\/p>\n<p>An obviously elated Dr. Cosmas Maduka, President\/CEO Coscharis Group, says, “I have utmost respect for all the finalists from different countries because each of us has a unique story to tell that resonates&nbsp;with the audience. It must have been a very difficult journey for the judges to arrive at their decision and we have to respect it because they have their criteria set. At the end of the day, if I had a choice, I would have given the global award to Dr. Kiran Mazumdar-Shaw still like the judges did.&nbsp; It is really not easy to contend among men and she must have done something much better than the rest of us that stood her out in the mind of the judges.&nbsp; I therefore congratulate her and all the finalists this year.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Sequel to Dr Cosmas Maduka’s emergence as the winner of Ernst &amp; Young Entrepreneur of the Year 2020 award for the West Africa region, he officially joined the “EY World Entrepreneur of the Year” Class of 2020 along with 46 other exceptional entrepreneurs from 41 countries across the globe. The global event, originally scheduled to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"om_disable_all_campaigns":false,"ngg_post_thumbnail":0},"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/200527"}],"collection":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/comments?post=200527"}],"version-history":[{"count":1,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/200527\/revisions"}],"predecessor-version":[{"id":200529,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/200527\/revisions\/200529"}],"wp:attachment":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/media?parent=200527"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/categories?post=200527"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/tags?post=200527"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}