{"id":2019,"date":"2017-07-18T10:30:22","date_gmt":"2017-07-18T09:30:22","guid":{"rendered":"https:\/\/coscharisgroup.net\/?p=2019"},"modified":"2017-07-20T15:10:55","modified_gmt":"2017-07-20T14:10:55","slug":"coscharis-technologies-launches-a-mobile-school-in-nigeria","status":"publish","type":"post","link":"https:\/\/coscharisgroup.net\/coscharis-technologies-launches-a-mobile-school-in-nigeria","title":{"rendered":"COSCHARIS TECHNOLOGIES LAUNCHES A MOBILE SCHOOL IN NIGERIA"},"content":{"rendered":"<p>&nbsp;<\/p>\n<h2 style=\"text-align: center;\"><strong><u>COSCHARIS TECHNOLOGIES LAUNCHES<\/u><\/strong> <strong><u>A MOBILE SCHOOL IN NIGERIA<\/u><\/strong><\/h2>\n<p>&nbsp;<\/p>\n<p><strong><u><img loading=\"lazy\" class=\"size-full wp-image-2020 aligncenter\" src=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2017\/07\/Coscharis-Technologies.jpg\" alt=\"\" width=\"856\" height=\"570\" srcset=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2017\/07\/Coscharis-Technologies.jpg 856w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2017\/07\/Coscharis-Technologies-300x200.jpg 300w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2017\/07\/Coscharis-Technologies-768x511.jpg 768w\" sizes=\"(max-width: 856px) 100vw, 856px\" \/><\/u><\/strong><\/p>\n<p><u><\/u>Coscharis Technologies is pleased to introduce to the market through you our media partners our latest innovative product, <strong>COSCHARIS MOBILE SCHOOL (CMS)<\/strong>. This unique product is objectively designed to meet Nigerian educational needs, principally at the basic primary, secondary education levels and for teachers’ development towards improving their learning and teaching techniques in this digital age.   The <strong>Coscharis Mobile School (CMS)<\/strong> product device is an indispensable digital companion for pupils in Primary 1 to 6, and for students in JSS 1 to 3 and SSS 1 to 3 as well as for all teachers across these levels of education.   The device is handmade thus guarantee its durability, and most importantly, all the installed software applications are products of Research &amp; Development in the IT industry based on the updated Nigerian Educational Curriculum, both the New Nine (9) years and the Senior Secondary School curricula in all subjects.   We are excited to be a pacesetter in this landmark innovation which breaks the glass ceiling in our educational sector in Nigeria. We strongly believe this is a turning point for domestic growth and development in our local educational sector.   Briefly, we hereby present to you the <strong>CMS<\/strong> product device features, warranty, installed software applications, regulators&#8217; endorsements, compliance, prospective users, partners, demonstration, supply and more importantly the official introduction to the market : <strong> <\/strong><\/p>\n<h4><strong>CMS <\/strong><strong>Product Device Features &amp; Warranty<\/strong><\/h4>\n<p>The CMS product device is customizable to meet the needs of every user, particularly for the Nigeria market space. The device comes in 10’’ Tablets with the following features:<\/p>\n<ul>\n<li>10’’ IQuad Core 1.2 GHz processor, IPS Display, 1GB, 16GB Memory,<\/li>\n<li>Micro-SD slot for up to 32GB expandability, Dual SIM, 3G + Wifi, Android 6.0 OS, BT, Front Camera = 2MP, Rear Camera = 5MP, 5000mAH battery, 1 year warranty with Plastic back panel, Adaptor &amp; pouch cover.<\/li>\n<\/ul>\n<h4><strong>Installed Software Applications<\/strong><\/h4>\n<p>In addition to the device being user friendly in the Nigeria environment, the installed software applications are customizable to meet the needs of every user, either for pupils in Pry 1 to 6, students in JSS 1 to 3, SSS 1 to 3, or their respective teachers in all subjects. The software runs on Android Operating System(OS) and functions as graphics virtual and video classroom in all subjects across all classes, providing opportunity for the users to repeat and review each lesson as many times as they desire before undertaking inbuilt exams for self-evaluations to determine the progress in learning.<\/p>\n<h4><strong>Endorsements &amp; Compliance<\/strong><\/h4>\n<p>The <strong>CMS<\/strong> product device and installed software has the endorsement of the Federal Ministry of Education, Standard Organization of Nigeria(SON), National Information Technology Agency (NITDA) among other agencies of Government. Every product integration is in total compliance with international digital best practices in education delivery for learning and teaching experiences.<\/p>\n<h4><strong>Prospective Users &amp; Partners (Priority Audience)<\/strong><\/h4>\n<p>In summary, prospective users of the CMS Product device and installed software are the Nigerian pupils in Pry 1 to 6, students in JSS 1 to 3, SSS 1 to 3 and every teacher across these levels of education, both in public and private schools nationwide. To reach out to them, the collaboration and partnership of MDAs across all the tiers of government cannot be over-emphasized. These include:<\/p>\n<ul>\n<li>Federal Ministry of Education (Federal Government Unity Schools)<\/li>\n<li>States Ministries of Education (State Government Secondary Schools)<\/li>\n<\/ul>\n<ul>\n<li>Universal Basic Education Commission(UBEC)<\/li>\n<li>States Universal Basic Education Boards(SUBEBs) &#8211; Pry &amp; Junior Secondary Schools)<\/li>\n<li>Private Schools- independently and through NAPPS (National Association of Proprietors of Private Schools)<\/li>\n<li>Donor Agencies for the sustainable development of Education in Nigeria.<\/li>\n<\/ul>\n<h4><strong>Benefits <\/strong><strong>t<\/strong><strong>o <\/strong><strong>Users<\/strong><\/h4>\n<ul>\n<li>Both Offline and online access of CMS module<\/li>\n<li>Free offline videos and animation to aid teaching<\/li>\n<li>Over 20,000 past JAMB, WAEC , JSCE, Common Entrance and A-Level questions and answers<\/li>\n<li>Teachers e-teaching tools and curriculum for all classroom as directed by NERDC<\/li>\n<li>Quick summary of text books of more than 40 subjects<\/li>\n<li>Career Counselling Guide: Information about <a href=\"https:\/\/www.collinsdictionary.com\/dictionary\/english\/career\">careers<\/a>that <a href=\"https:\/\/www.collinsdictionary.com\/dictionary\/english\/help\">helps<\/a> your wards, <a href=\"https:\/\/www.collinsdictionary.com\/dictionary\/english\/decide\">decide<\/a> on a career and also <a href=\"https:\/\/www.collinsdictionary.com\/dictionary\/english\/teach\">teaches<\/a> them how to <a href=\"https:\/\/www.collinsdictionary.com\/dictionary\/english\/pursue\">pursue<\/a> their <a href=\"https:\/\/www.collinsdictionary.com\/dictionary\/english\/choose\">chosen<\/a> career<\/li>\n<li>Competitive Pricing<\/li>\n<li>Free Training on use of content<\/li>\n<li><strong>For the first time ever, you can have your wards sit for JAMB and WAEC exams every day from the comforts of your home. There is absolutely no reason why our youths should fail or sit repeatedly for these exams. This is the solution!<\/strong><\/li>\n<\/ul>\n<p><strong> <\/strong> <strong>CMS Product Demonstration<\/strong><strong>, Supply &amp; Cost Implications<\/strong><\/p>\n<p>We are ready at very short notice to stage this unique <strong>CMS<\/strong> Product demonstration at the invitation of all identified stakeholders mentioned above, as well as ready to respond with bulk supply of products to any purchase order at very cost-effective rate per unit and attractive discounts.<\/p>\n<h4><strong>Our Appeal (Media Partnership)<\/strong><\/h4>\n<p>With all pleasure therefore, we respectfully crave your indulgence to request for the your partnership in delivering this unique value to our educational sector by creating the required awareness of our value &#8211; adding new product, <strong>Coscharis Mobile School (CMS)<\/strong> to Nigeria and Nigerians.   While thanking you for honoring our invitation, please accept the assurances of our highest esteem and kind regards!   <strong> <\/strong><\/p>\n<h4><strong>About Coscharis Technologies Limited (COSTECH) <\/strong><\/h4>\n<p>Coscharis Technology Limited is a subsidiary of Coscharis Group, one of Nigeria&#8217;s most diversified wholly owned Nigerian Conglomerate that has reputation for representing various iconic brands that cuts across various business sectors which impacts positively in the economy of the nation. Coscharis Technologies Limited is an information and communications technology (ICT) solutions company incorporated in 1993. Coscharis Technologies Limited is in the forefront of innovative pursuits that has changed the landscape for the deployment of ICT technologies in Nigeria.  COSTECH engages in the marketing and distribution of computer and telecommunication equipment and the development and maintenance of modern software applications. It is an authorized partner\/distributor to some of the world’s best ICT brands such as, HP (Hewlett Packard) IBM\/Lenovo, APC, Microsoft, Samsung, DS Solidworks, ASUS, and Mercury. With strategically located offices in Lagos (Ikeja and Head Office in Victoria Island), Abuja, Kaduna, and Port Harcourt as well as with effective support of the Group’s network of branches in such areas where we are not located, namely Maiduguri, Benin, Ibadan, Kano, Uyo, Nnewi, Aba etc, the company is able to serve its numerous customers from all parts of Nigeria. Fully backed by the group’s financial strength, Coscharis Technologies is always exploring more innovative ways of realizing its mission. Please visit <a href=\"http:\/\/www.coscharis-tech.com\">www.coscharis-tech.com<\/a> or <a href=\"http:\/\/www.coscharisgroup.net\">www.coscharisgroup.net<\/a> for more information <strong> <\/strong><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; COSCHARIS TECHNOLOGIES LAUNCHES A MOBILE SCHOOL IN NIGERIA &nbsp; Coscharis Technologies is pleased to introduce to the market through you our media partners our latest innovative product, COSCHARIS MOBILE SCHOOL (CMS). This unique product is objectively designed to meet Nigerian educational needs, principally at the basic primary, secondary education levels and for teachers’ development [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"om_disable_all_campaigns":false,"ngg_post_thumbnail":0},"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/2019"}],"collection":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/comments?post=2019"}],"version-history":[{"count":5,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/2019\/revisions"}],"predecessor-version":[{"id":2026,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/2019\/revisions\/2026"}],"wp:attachment":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/media?parent=2019"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/categories?post=2019"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/tags?post=2019"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}