{"id":2195,"date":"2017-08-24T12:08:42","date_gmt":"2017-08-24T11:08:42","guid":{"rendered":"https:\/\/coscharisgroup.net\/?p=2195"},"modified":"2017-08-24T12:08:42","modified_gmt":"2017-08-24T11:08:42","slug":"ford-and-coscharis-delight-customers-with-discounted-service-parts","status":"publish","type":"post","link":"https:\/\/coscharisgroup.net\/ford-and-coscharis-delight-customers-with-discounted-service-parts","title":{"rendered":"FORD AND COSCHARIS DELIGHT CUSTOMERS WITH DISCOUNTED SERVICE PARTS"},"content":{"rendered":"<p><b>LAGOS, Nigeria, DATE <\/b><span style=\"font-weight: 400;\">– In its quest to continually deliver quality aftersales service with genuine parts to its numerous loyal customers, Ford and its sole dealer in Nigeria, Coscharis Motors Plc, is giving out 10% discount on some select ford parts from now till end of September, 2017. This is in line with its commitment to safety and maintenance of its customers’ vehicles at various locations across the country.<\/span><\/p>\n<h2><\/h2>\n<p><span style=\"font-weight: 400;\">According to Abiona Babarinde, General Manager, Marketing and Corporate Communications at Coscharis Group, “this aftersales campaign is timely and strategic to sustaining our leadership status when it comes to delivering value for money as it relates to our loyal customers.” Abiona further stated, “There is no gain-saying that the economic situation in the country has affected so many things including vehicle maintenance. This is the more reason why we have taken it upon ourselves as a customer-centric brand to give our loyal customers some relief in this challenging period. We want to excite our customers with these offerings of 10% discount on some select parts like brake, shocks, battery and service parts to cushion their expenses at this period at our various aftersales service centres and Quick Lane facilities that are now in many neighbourhoods across the country.”<\/span><\/p>\n<h2><\/h2>\n<p><span style=\"font-weight: 400;\">To confirm the readiness of the company to the success story of this campaign, the National Parts Manager, Coscharis Motors Plc, Cyril Cruz said “we are fully stocked with all required genuine parts in all our aftersales centres which brings our service closer to you to make this campaign successful. We don’t want our customers to settle for substitutes. As has been proven again and again, counterfeit or substandard parts and lubricants may appear cheap in the beginning but in the long run, it is penny wise and pound foolish.”<\/span><\/p>\n<h2><\/h2>\n<p><span style=\"font-weight: 400;\">Cyril maintained that substandard parts will appear to be working while they are in actual sense inflicting more damage on the vehicle. He also averred that Ford genuine parts come with manufacturer warranty and would be replaced under warranty if found to be faulty.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">The programme also aims to promote the locations of the various Coscharis facilities that make up a comprehensive footprint in Nigeria, where it has 17 after-sales service centres as well as Certified Parts Wholesale Dealers (CPWD) partners and Ford-backed Quick Lane Tyre and Auto Centres.<\/span><\/p>\n<h2><\/h2>\n<p><span style=\"font-weight: 400;\">Coscharis sees this as an ideal programme to build relationships with its Ford customers as their cars will be in safe hands. All the technicians working at the Ford dealerships are factory-trained and Ford-certified. Only genuine Ford or Motorcraft replacement parts and approved lubricants are used when servicing vehicles at Coscharis ford Service Centres. Genuine parts and approved lubricants are also available through CPWD outlets.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>LAGOS, Nigeria, DATE – In its quest to continually deliver quality aftersales service with genuine parts to its numerous loyal customers, Ford and its sole dealer in Nigeria, Coscharis Motors Plc, is giving out 10% discount on some select ford parts from now till end of September, 2017. This is in line with its commitment to safety and [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"om_disable_all_campaigns":false,"ngg_post_thumbnail":0},"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/2195"}],"collection":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/comments?post=2195"}],"version-history":[{"count":3,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/2195\/revisions"}],"predecessor-version":[{"id":2198,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/2195\/revisions\/2198"}],"wp:attachment":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/media?parent=2195"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/categories?post=2195"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/tags?post=2195"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}