{"id":220087,"date":"2021-04-06T17:33:32","date_gmt":"2021-04-06T16:33:32","guid":{"rendered":"https:\/\/coscharisgroup.net\/?p=220087"},"modified":"2021-04-06T17:33:32","modified_gmt":"2021-04-06T16:33:32","slug":"coscharis-delights-renault-customers-with-mouth-watering-easter-giveaways","status":"publish","type":"post","link":"https:\/\/coscharisgroup.net\/coscharis-delights-renault-customers-with-mouth-watering-easter-giveaways","title":{"rendered":"COSCHARIS DELIGHTS RENAULT CUSTOMERS WITH MOUTH-WATERING EASTER GIVEAWAYS"},"content":{"rendered":"<p>Foremost automobile company and sole distributor of Renault brand in Nigeria, Coscharis Motors Plc, has announced mouth-watering offers for its Renault customers throughout the month of April, in the spirit of the Easter celebrations. <strong>These giveaways include, free ABRO Generator, 5% price discount, free insurance, free vehicle registration and first 2 services free of charge.<\/strong><\/p>\n<p>&nbsp;<\/p>\n<p>Announcing these offerings, Felix Mahan, the Brand Manager, Renault at Coscharis Motors said, “We are excited to offer this bumper Easter giveaways to our Renault customers; It is our special way of welcoming new customers to own a brand new Renault vehicle with lots of other juicy products which include a brand new Abro generator. This equally extends to existing Renault customers who may wish to trade-in their current cars for the latest models of the French made vehicles”.<\/p>\n<p>&nbsp;<\/p>\n<p>The Easter giveaway offering is available on the Renault Kwid and Koleos only.<\/p>\n<p>&nbsp;<\/p>\n<p>In the same vein, Abiona Babarinde, the General Manager, Marketing and Corporate Communications, Coscharis Group posited that the Easter festive period was chosen specifically to encourage numerous stakeholders towards purchasing both the Renault Kwid and Koleos. Babarinde said, “Since we took over the responsibility of representing the respected French brand in Nigeria, we felt it will not be a bad idea to use this festive period of Easter to delight our numerous stakeholders who will be discerning to own a brand new vehicle during this period. The good thing about this special campaign is that it is open to both existing owners of the Renault brand and others that are yet to have a feel of this iconic French brand. Again, aside the mouth offering giveaways, Coscharis as the exclusive franchise owner of the brand in Nigeria promises to deliver the total brand experience beyond just the new purchase. We are equipped with the original parts, right tools to fix the original parts and the certified Renault technicians to deliver your total aftersales experience throughout our workshop outlets located in all the six geo – political zones in Nigeria”.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>RENAULT KWID<\/strong><\/p>\n<p><strong>&nbsp;<\/strong><\/p>\n<p>The Renault Kwid is a compact car with the robustness and look of an SUV. It brings together the practicality of a compact car with the specifications of a genuine SUV: a sturdy and striking design, as well as economy and technological advances. Besides, its front grille, 14” wheel rims and door mirror shells give it a distinctive look when compared to other cars in its class.<\/p>\n<p><img loading=\"lazy\" class=\"size-large wp-image-220089 alignright\" src=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2021\/04\/Renault-Kwid-1024x653.png\" alt=\"\" width=\"640\" height=\"408\" srcset=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2021\/04\/Renault-Kwid-1024x653.png 1024w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2021\/04\/Renault-Kwid-300x191.png 300w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2021\/04\/Renault-Kwid-768x490.png 768w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2021\/04\/Renault-Kwid.png 1127w\" sizes=\"(max-width: 640px) 100vw, 640px\" \/><\/p>\n<p>Renault KWID’s interior space is a masterful blend of modernity and ergonomics. The car is roomy and comfortable for driver and passengers alike. And, for added convenience, Renault KWID is equipped with numerous storage spaces and a spacious boot (290 litres), making day-to-day life easier.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>RENAULT KOLEOS<\/strong><\/p>\n<p>&nbsp;<\/p>\n<p>Renault Koleos is an SUV specially designed to broaden your outlook. An unprecedented combination of power and refinement, its assertive design pushes the boundaries of what is expected and expresses itself with bold style. Its confident stature commands respect. An SUV with broad shoulders and muscular side panels, its robust front end, broad tyres and large wheelbase give it the look of a partner that can rise to any challenge. The Renault Koleos takes you further, whichever path you take, whatever your quest.<\/p>\n<p>&nbsp;<\/p>\n<p>The Renault Koleos can be described as the art of drawing attention. It embodies new aspirations. Charismatic, with a sense of detail and personality enhanced by its sleek appearance and athletic curves. Everything in the Koleos is designed for your driving pleasure. The ergonomics of the centre console, which puts the main controls at your fingertips, the technologies controlled by the R-LINK 2 multimedia system with its 8.7-inch touchscreen, the personalisation of the TFT instrument panel and the innovative driver assistance tools all help create an unprecedented experience combining pleasure and ease on board.<\/p>\n<p><img loading=\"lazy\" class=\"size-large wp-image-220088 alignleft\" src=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2021\/04\/Renault-Koleos-1024x608.png\" alt=\"\" width=\"640\" height=\"380\" srcset=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2021\/04\/Renault-Koleos-1024x608.png 1024w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2021\/04\/Renault-Koleos-300x178.png 300w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2021\/04\/Renault-Koleos-768x456.png 768w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2021\/04\/Renault-Koleos.png 1231w\" sizes=\"(max-width: 640px) 100vw, 640px\" \/><\/p>\n<p>The design of the Koleos and the choice of materials will meet all of your expectations. The finish of the overstitched leather, the satin finish of the chrome inserts and the immaculate trim of the doors provide a level of comfort that is worthy of a large saloon. The grab handles on either side of the centre console and the raised driving position let you know that you are in a real SUV.<\/p>\n<p>&nbsp;<\/p>\n<p>The Koleos allows you to immerse yourself in a rich acoustic experience, as intense as a live concert, with the Bose® audio system. Configure the features of the large, connected R-LINK 2 touch screen, taking full control of the vehicle, multimedia, navigation, telephone and driving assistance functions. The generous amount of space has been dedicated to your comfort and that of your passengers. Your seat hugs you whilst the sunroof opens up new perspectives. You experience the spirit of adventure that comes with SUVs from the comfort of your “cocoon”, both in front and in the rear. To make your life easier, Renault has fitted the New Koleos with Remote Engine Start. Programme it with the time that you want your vehicle to start and by the time you step into your car, the temperature inside will be perfect. Welcome to a new kind of comfort with programmable settings.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>Drive the New Koleos and experience the e­ffect of its all-terrain ALL MODE 4&#215;4-i technology; its engine, connected to its new X-Tronic gearbox; and its numerous driver assistance technologies—not to mention the unique quality of its Bose® sound system. It’s the kind of performance that will always take you further, be it on an urban adventure or o­ the beaten track.<\/p>\n<p>&nbsp;<\/p>\n<p>There are two variants of the Renault Koleos available in the Nigerian market to select from, ZEN which is the 2WD CVT, 5 speed automatic transmission and INTENSE, which is the 4WD CVT, 5 speed automatic transmission.<\/p>\n<p>&nbsp;<\/p>\n<p>Follow us on our social media handles: &#8211;<\/p>\n<ul>\n<li>Facebook: https:\/\/www.facebook.com\/RenaultCoscharis<\/li>\n<li>Instagram: https:\/\/www.instagram.com\/renaultnigeria\/<\/li>\n<li>Twitter: <a href=\"https:\/\/twitter.com\/RenaultNigeria\">https:\/\/twitter.com\/RenaultNigeria<\/a><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Foremost automobile company and sole distributor of Renault brand in Nigeria, Coscharis Motors Plc, has announced mouth-watering offers for its Renault customers throughout the month of April, in the spirit of the Easter celebrations. These giveaways include, free ABRO Generator, 5% price discount, free insurance, free vehicle registration and first 2 services free of charge. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"om_disable_all_campaigns":false,"ngg_post_thumbnail":0},"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/220087"}],"collection":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/comments?post=220087"}],"version-history":[{"count":5,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/220087\/revisions"}],"predecessor-version":[{"id":220094,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/220087\/revisions\/220094"}],"wp:attachment":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/media?parent=220087"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/categories?post=220087"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/tags?post=220087"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}