{"id":220029,"date":"2021-03-31T08:48:35","date_gmt":"2021-03-31T07:48:35","guid":{"rendered":"https:\/\/coscharisgroup.net\/?p=220029"},"modified":"2021-03-31T08:48:35","modified_gmt":"2021-03-31T07:48:35","slug":"coscharis-motors-easter-special-offer","status":"publish","type":"post","link":"https:\/\/coscharisgroup.net\/coscharis-motors-easter-special-offer","title":{"rendered":"COSCHARIS MOTORS EASTER SPECIAL OFFER"},"content":{"rendered":"<p>Coscharis Motors Plc has announced exclusive offers for its range of auto products for the entire period of Easter. These offers range from favourable pricing, giveaways, complementary insurance, registration and services.<\/p>\n<p>In his words, the General Manager, Marketing and Corporate Communications, Coscharis Group, Abiona Babarinde, “existing customers and new customers now have the opportunity to drive away either the Jaguar, Land Rover, BMW, Ford or Renault variants with ad-on during this Easter period. This is another way of appreciating our numerous loyal customers who have been consistent with their patronage over the years to enjoy this special offerings to celebrate the Easter festive season. Also, as a way of cultivating new customers, we are equally extending this package to accommodate all our hot prospects alike to own any of our iconic brands with ease”.<\/p>\n<p>Price offers ranges from 5% upwards across the brands, every Renault (Kwid &amp; Koleos) purchase comes with a free Abro generator while Jaguar Land Rover offers a complementary 5 years warranty and 5 years free service including special pricing for the Jaguar E Pace.&nbsp; It is important to note that these offers are only valid while stocks last. Major price slashes are offered for the Ford Escape, BMW X4, 4 and 3 series amongst others.<\/p>\n<p>According to Babarinde, the value for money that the Coscharis brand brings to the market at this point is the product mix that gives the opportunity to customers to own different products within the group for a lesser amount like getting an Abro generator with a vehicle purchase.<\/p>\n<p>&nbsp;<\/p>\n<p><em>Coscharis Motors is the sole franchisee of Jaguar Land Rover, BMW, Ford and Renault brands in Nigeria and boasts of a wide dealership &#8211; sales and service network across the country with a well trained and effective team. It currently stocks these brands across all the geo-political zones in Nigeria. <\/em><em>You can follow us on all our social media platforms for more information via coscharisgroup (Instagram), coscharis group (facebook) and coscharis_group (twitter)<\/em><\/p>\n<p>&nbsp;<\/p>\n<p><strong>Abiona Babarinde<\/strong><\/p>\n<p><strong>GM, Marketing and Corporate Communications<\/strong><\/p>\n<p><strong>Coscharis Group<\/strong><em>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Coscharis Motors Plc has announced exclusive offers for its range of auto products for the entire period of Easter. These offers range from favourable pricing, giveaways, complementary insurance, registration and services. In his words, the General Manager, Marketing and Corporate Communications, Coscharis Group, Abiona Babarinde, “existing customers and new customers now have the opportunity to [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"om_disable_all_campaigns":false,"ngg_post_thumbnail":0},"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/220029"}],"collection":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/comments?post=220029"}],"version-history":[{"count":1,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/220029\/revisions"}],"predecessor-version":[{"id":220030,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/220029\/revisions\/220030"}],"wp:attachment":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/media?parent=220029"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/categories?post=220029"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/tags?post=220029"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}