{"id":222165,"date":"2021-08-10T16:01:06","date_gmt":"2021-08-10T15:01:06","guid":{"rendered":"https:\/\/coscharisgroup.net\/?p=222165"},"modified":"2021-08-10T16:06:37","modified_gmt":"2021-08-10T15:06:37","slug":"coscharis-motors-media-reveal-of-the-all-new-jaguar-f-pace","status":"publish","type":"post","link":"https:\/\/coscharisgroup.net\/coscharis-motors-media-reveal-of-the-all-new-jaguar-f-pace","title":{"rendered":"COSCHARIS MOTORS MEDIA REVEAL OF THE ALL NEW JAGUAR F PACE"},"content":{"rendered":"<p>The leading automobile Company, Coscharis Motors Plc recently introduced the All new Jaguar F-PACE at a media reveal in the Jaguar Land Rover showroom in Awoyaya, Lagos. It was a gathering of media partners to the Company across luxury and auto segments who became some of the first group of stakeholders to have a feel of the new vehicle in Nigeria.<br \/>\nSetting the pace for the day was the opening remarks by the General Manager, Marketing and Corporate Communications, Coscharis Group in person of Abiona Babarinde who officially welcomed all the media partners to the official unveil of the new Jaguar F-PACE. In his words, “we are delighted as the exclusive representative of the Jaguar Land Rover brand in Nigeria over the years to once again introduce the All New Jaguar F-PACE into the Nigeria market at this point in time. The luxury performance SUV brings together award-winning design, Jaguar performance and intuitive technologies to make every journey feel extraordinary.<br \/>\nRiding on the acceptance of the SUV variant of the Jaguar brand by Nigerians gives us lots of confidence that this new Jaguar F-PACE will equally do well like the previous models. More importantly for Jaguar enthusiasts, Coscharis Motors aside from the unique aftersales deliverables that come with our Sales offerings, this time around has come up with series of vehicle finance schemes in partnership with reputable finance institutions including our sister firm, Coscharis Mobility to ease the purchase of this luxury item without much of financial stress. This scheme guarantees ownership with as low as 10% to 30% down payment of the principal amount of the vehicle and you are god to go with your dream vehicle”,<br \/>\nShowcasing the unique selling propositions of the new Jaguar F Pace to the media team present, the Deputy General Manager, Sales for the Jaguar Land Rover brand, Ufuoma Umukoro said “the new Jaguar F-PACE which comes in two modes S and R- Dynamic, delivers a tranquil sanctuary for you and your passengers. Premium materials, new colourways and improved seat comfort are found throughout the all-new interior’’.<br \/>\nThe new F-PACE features an 8 speed automatic transmission with an improved torque and acceleration, CO2 emissions are reduced to 170g\/km with fuel economy now down to 7.3\/100km.The transmission and dynamics systems have also benefitted from incremental tweaks. You can choose between full dynamic performance and maximizing fuel economy. JaguarDrive Control performs gearshifts more quickly in Dynamic Mode and earlier up-shifts in Eco Mode. Rain, mud Mode switches to more gentle progress in low grip conditions. At the same time, F-PACE is now more comfortable and enjoyable to drive at a relaxed pace, without compromising its high-speed dynamics, further underlining the new model’s duality of purpose.<br \/>\nHe stated further that “for hassle-free repairs and replacements, customers can enjoy the reassurance of our standard five-year manufacturer’s warranty and five-year complimentary service, which is a first in the luxury segment”.<br \/>\nThe reveal event was rounded up with a facility tour of the Jaguar Land Rover workshop where the aftersales team delivers the ‘peace of mind’ for customers in maintaining their favorite luxury automobile.<br \/>\nFurther Upgrades<br \/>\nDRIVING PERFORMANCE<br \/>\nThe steering system is enhanced with a new electronic power-assistance system delivering greater immediacy, providing a heightened connection between the vehicle and driver. Jaguar All-Wheel Drive with Intelligent Driveline Dynamics is a predictive all-wheel drive system. While others become active only after the car loses traction, our system pre-emptively shifts torque to the front wheels to maintain control and composure before grip is lost.<br \/>\nEXTERIOR DESIGN<br \/>\nThe seamless bonnet, deeper grille, new double ‘J’ blade signature headlights and wider vents all add to Jaguar F PACE’s dynamic stance and on-road presence. The new integrated exhaust finishers compliment the redesigned rear bumper, further highlighting the purposeful stance.<\/p>\n<p>INTERIOR PEACE, QUIET AND COMFORT<\/p>\n<p>With Active road noise cancellation, thanks to the innovative technology from audio experts Meridian Audio7; reduced levels of vibration, F PACE’s newly redesigned interior features Luxtec or leather wrapped surfaces offers an improved ride comfort.<\/p>\n<p>WIRELESS CHARGING<br \/>\nOptional wireless device charging with phone signal booster lets you charge compatible smartphones without the need for wires or a charging dock. While in the car, your phone will use the vehicle’s antenna for improved signal and clearer calls.<br \/>\nDRIVER ASSISTANCE<br \/>\nJaguar F-PACE has been built with driver assistance features that help make getting around town and parking easier, and driving on motorways more enjoyable. These technologies enhance your drive by helping to take the stress out of it.<\/p>\n<p><iframe loading=\"lazy\"  id=\"_ytid_46993\"  width=\"640\" height=\"360\"  data-origwidth=\"640\" data-origheight=\"360\"  src=\"https:\/\/www.youtube.com\/embed\/8QnmuM02HqA?enablejsapi=1&#038;autoplay=0&#038;cc_load_policy=0&#038;cc_lang_pref=&#038;iv_load_policy=1&#038;loop=0&#038;modestbranding=0&#038;rel=1&#038;fs=1&#038;playsinline=0&#038;autohide=2&#038;theme=dark&#038;color=red&#038;controls=1&#038;\" class=\"__youtube_prefs__  epyt-is-override  no-lazyload\" title=\"YouTube player\"  allow=\"autoplay; encrypted-media\" allowfullscreen data-no-lazy=\"1\" data-skipgform_ajax_framebjll=\"\"><\/iframe><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The leading automobile Company, Coscharis Motors Plc recently introduced the All new Jaguar F-PACE at a media reveal in the Jaguar Land Rover showroom in Awoyaya, Lagos. It was a gathering of media partners to the Company across luxury and auto segments who became some of the first group of stakeholders to have a feel [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"om_disable_all_campaigns":false,"ngg_post_thumbnail":0},"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/222165"}],"collection":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/comments?post=222165"}],"version-history":[{"count":1,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/222165\/revisions"}],"predecessor-version":[{"id":222166,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/222165\/revisions\/222166"}],"wp:attachment":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/media?parent=222165"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/categories?post=222165"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/tags?post=222165"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}