{"id":2350,"date":"2017-10-17T12:21:51","date_gmt":"2017-10-17T11:21:51","guid":{"rendered":"https:\/\/coscharisgroup.net\/?p=2350"},"modified":"2017-10-17T12:21:51","modified_gmt":"2017-10-17T11:21:51","slug":"welcome-speech-by-the-president-of-coscharis-group-dr-cosmas-maduka-con-at-the-media-launch-of-the-coscharis-ford-skd-plant-in-lekki-on-friday-13th-october-2017","status":"publish","type":"post","link":"https:\/\/coscharisgroup.net\/welcome-speech-by-the-president-of-coscharis-group-dr-cosmas-maduka-con-at-the-media-launch-of-the-coscharis-ford-skd-plant-in-lekki-on-friday-13th-october-2017","title":{"rendered":"WELCOME SPEECH BY  THE PRESIDENT OF COSCHARIS GROUP  DR. COSMAS MADUKA, CON AT THE MEDIA LAUNCH OF THE  COSCHARIS FORD SKD PLANT IN LEKKI  ON FRIDAY, 13TH OCTOBER, 2017."},"content":{"rendered":"<p>It is my singular honour and privilege to welcome you to this special event, which is to officially unveil our newly built Assembly Plant to you all as our media partners which is the first ever Ford Assembly Plant in Nigeria and indeed the entire Sub-Sahara Africa.<\/p>\n<h5><\/h5>\n<p>It has been a long wait from when we first announced in November 2015 that we had commenced physical structuring of the new Plant sighted on a piece of land of more than 14 Hectares within our Lekki Group head office in Lagos. Thus we are thankful to God that the day has finally come when you all shall witness the actual process of production taking place right here, in the Plant.<\/p>\n<h5><\/h5>\n<p>Indeed it is a dream come true.  Coscharis Group have been a great believer on the possibilities that lie ahead in this our great Nation and we have shown courage by the actions that we are taking in investing in the future of Nigeria.<\/p>\n<h5><\/h5>\n<p>Although we are here today, to unveil our newly built Assembly Plant for Ford brand but you are all aware of the giant steps Coscharis Group has taken in the last few years in the Agricultural Sector of our economy.<\/p>\n<h5><\/h5>\n<p>Today’s event is to showcase another initiative from our great organization, Coscharis Motors Plc, to further create value as a leading player in the automotive industry in Nigeria, in response to the clarion call of the Federal Government of Nigeria through the National Automotive Industry Development Plan (NAIDP). This is also to appreciate the confidence that the globally respected iconic brand, FORD, reposed in us as their exclusive official representative in Nigeria to roll out the very first Ford Assembly Plant in Nigeria. This milestone marks another first in the evolution of our company towards remaining timeless in its relevance.<\/p>\n<h5><\/h5>\n<p>The National Automotive Industry Development Plan aims, among other objectives, to discourage the importation of Completely Built vehicles and encourage the local manufacturing of vehicles through either Complete Knocked Down or Semi Knocked Down facilities for a start. We are aware that a few automobile companies have also initiated their process towards achieving this objective. However, at Coscharis Motors Plc, our concern and commitment to our loyal customers and stakeholders is to, as usual, set standards that other players will be judged by in the industry.<\/p>\n<h5><\/h5>\n<p>At the moment, our focus at the Plant is to rollout the Ford Ranger, which is a multipurpose mini-truck that serves well for both work and leisure. As you are all aware, Ford has a global standard for all of its products including the Ranger. Therefore, Ford’s certification of our facility and output is a confirmation that every single Ranger that rolls out of this plant is indeed “Built Ford Tough&#8221; from which we&#8217;ve rolled out over 600 units from this facility since we started operation; some of which are on display outside. But we will not rest on our oars as we are sure to wax stronger into the future with the introduction of other great Ford variants into the assembly line.<\/p>\n<h5><\/h5>\n<p>It might be news worthy to mention here that this is a capital intensive project, which also involves huge financial, technical and human resources commitment. Therefore the fact that we have ventured into it headlong underpins the level of confidence and hope we have for the future of the Nigerian automotive industry. This is to underscore the human capital opportunities that stand to be delivered in terms of employment and by extension the multiplier effect on the economic development of our dear country, Nigeria.<\/p>\n<h5><\/h5>\n<p>We have always dreamt of a Nigeria that will take its place in the global arena, a Nigeria that sits among the egalitarians in the committee of Nations, taken its rightful place in the pages of history.  Our factory is the second ever Ford manufacturing outfit in the entire African continent, outside of South Africa; something we indeed, are very proud of.  By this, Coscharis as an organization, reinforces its belief in the Nigerian project that this is the only country we have and absolutely nothing else.<\/p>\n<h5><\/h5>\n<p>So we have taken the challenge for our generation as a result of this huge investment we&#8217;ve taken as a strong believer in our dear country as an entity, we can only but demand for governmental support in terms of enabling environment vis-à-vis basic infrastructures that are required to keep the manufacturing process on and more importantly the purchase patronage of the finished products from the Plant.<\/p>\n<h5><\/h5>\n<p>Nelson Mandela once said that sometimes it falls upon a generation to be great and I say we can be that great generation but the only true way to let our greatness blossom is to dignify it via action.  It is therefore in reflection of all of these realities and celebration of the future possibilities that lies ahead, that we are gathered here today.<\/p>\n<h5><\/h5>\n<p>Once again, we are highly honoured for honoring our invitation to this special event as I invite you to join me and my team on a facility tour of this our state &#8211; of &#8211; the &#8211; art facility.<\/p>\n<h5><\/h5>\n<p>Thank you and God bless.<\/p>\n<h5><\/h5>\n<p><strong>DR COSMAS MADUKA CON<\/strong><\/p>\n<h6><\/h6>\n<p><strong>PRESIDENT\/CEO<\/strong><\/p>\n<p><strong>COSCHARIS GROUP<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>It is my singular honour and privilege to welcome you to this special event, which is to officially unveil our newly built Assembly Plant to you all as our media partners which is the first ever Ford Assembly Plant in Nigeria and indeed the entire Sub-Sahara Africa. It has been a long wait from when [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"om_disable_all_campaigns":false,"ngg_post_thumbnail":0},"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/2350"}],"collection":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/comments?post=2350"}],"version-history":[{"count":3,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/2350\/revisions"}],"predecessor-version":[{"id":2353,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/2350\/revisions\/2353"}],"wp:attachment":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/media?parent=2350"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/categories?post=2350"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/tags?post=2350"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}