{"id":755,"date":"2016-09-22T12:04:27","date_gmt":"2016-09-22T11:04:27","guid":{"rendered":"https:\/\/coscharisgroup.net\/?p=755"},"modified":"2016-09-26T16:17:16","modified_gmt":"2016-09-26T15:17:16","slug":"coscharis-motors-partners-chisco-transport-on-rides-rewards-promo","status":"publish","type":"post","link":"https:\/\/coscharisgroup.net\/coscharis-motors-partners-chisco-transport-on-rides-rewards-promo","title":{"rendered":"COSCHARIS MOTORS PARTNERS CHISCO TRANSPORT ON RIDES &#038; REWARDS PROMO"},"content":{"rendered":"<p>Two major players in the transportation sector, Coscharis Motors Limited and Chisco Transport Limited are set to jointly delight customers \/ travellers on the Chisco platform. At a joint media briefing held recently in Lagos to formally announce the unique loyalty campaign tagged &#8221;Rides and Rewards Promo&#8221;, the two companies together with other stakeholders present unveiled the details of the campaign which majorly was to digitalise local transport business with the travellers in mind.<\/p>\n<p>&nbsp;<\/p>\n<p>The Rides &amp; Rewards Quarterly Promo comes with a Brand new <a href=\"https:\/\/coscharisgroup.net\/coscharis-motors-mg\">Morris Garages <\/a>3 series car as star prize give away and several consolation prizes worth millions of Naira. The promo is structured to run every quarter to reward frequent travellers and it is exclusive to online bookings strictly for those that patronise Chisco transport vehicles.<\/p>\n<p>&nbsp;<\/p>\n<p>While addressing the media partners at the briefing, Mr. Abiona Babarinde, General Manager Marketing &amp; Corporate Communications, Coscharis Group said Coscharis is proud to identify with Chisco for trailing the blaze on the digitalization of the road transport industry in Nigeria. Abiona noted, “Coscharis is a value driven organization and as such, we find a brand fit in any organization which takes the offering of value added goods and services to its customers seriously. This is what Chisco transport Ltd has demonstrated by creating this digital platform for its customers to initialize and conclude their road transport bookings online, thus our decision to partner with them to further delight their customers.”<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-760\" src=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2016\/09\/DSC_1449-300x199.jpg\" alt=\"dsc_1449\" width=\"500\" height=\"332\" srcset=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2016\/09\/DSC_1449-300x199.jpg 300w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2016\/09\/DSC_1449-768x509.jpg 768w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2016\/09\/DSC_1449-1024x678.jpg 1024w\" sizes=\"(max-width: 500px) 100vw, 500px\" \/><\/p>\n<p>He went on, “We are equally proud that Chisco has chosen one of our great brands we represent in Nigeria, the MG3 as the star prize for their loyalty reward promo. The <a href=\"https:\/\/coscharisgroup.net\/coscharis-motors-mg\">MG<\/a> which is the acronym for Morris Garages, is a British brand which has been around since 1924 and Coscharis Motors is the exclusive franchise owner in Nigeria. The MG3 is regarded as a supermini car and like the rest of its siblings in the <a href=\"https:\/\/coscharisgroup.net\/coscharis-motors-mg\">MG<\/a> range, it is respected around the world for its sleek designs, world class performance and ICT savvy. There is no doubt that the eventual winner of this promo will go home with an automobile machine to be proud of.”<\/p>\n<p>&nbsp;<\/p>\n<p>On his part, the Director, Assets Management, Chisco Group, Mr. Obinna Anyaegbu said, “As a brand we are spurred to tow this direction, knowing that digitisation is cutting across all layers of our society to the extent that virtually every action we take today has a digital approach to it.<\/p>\n<p>&nbsp;<\/p>\n<p>“As one of the industry giants, our strategic focus is to develop and drive an integrated transportation system that is digitally holistic in design and functionalities to promote contactless ticketing, improve operational efficiency, and create better experiences for our customers.” He added, “Our choice of partners &#8211; Coscharis Motors, Zenith Bank, Interswitch, TECNO Mobile- is inspired by their techie savvy and compatibility at pioneering the next-generation vehicles, transport systems solutions, and smart mobility services that comes with the future today.”<\/p>\n<p>With the most secured online bus booking portal, Instant ticketing via email and SMS, Realtime bookings, online; Payment via Zenith bank global pay and internet banking platform, USSD and all Interswitch platforms, 24\/7 Customer Help-Desk, Best online discount and ERP Integration with AGABAH. The CHISCO Transport digitisation is taking all competitors to the cleaners.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-757\" src=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2016\/09\/DSC_1446-300x199.jpg\" alt=\"dsc_1446\" width=\"501\" height=\"332\" srcset=\"https:\/\/coscharisgroup.net\/wp-content\/uploads\/2016\/09\/DSC_1446-300x199.jpg 300w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2016\/09\/DSC_1446-768x509.jpg 768w, https:\/\/coscharisgroup.net\/wp-content\/uploads\/2016\/09\/DSC_1446-1024x678.jpg 1024w\" sizes=\"(max-width: 501px) 100vw, 501px\" \/><\/p>\n<p>The Chisco digital direction is designed to create more jobs, drive financial independence and support the spirit of entrepreneurship through its ticketing Agency model and business integrations, benchmarking the international Air Transport ticketing model.<\/p>\n<p>&nbsp;<\/p>\n<p>The event was packaged by AGABAH for Chisco Transport in partnership with Coscharis Motors, Zenith Bank, Interswitch, TECNO Mobile, and COOL FM.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Two major players in the transportation sector, Coscharis Motors Limited and Chisco Transport Limited are set to jointly delight customers \/ travellers on the Chisco platform. At a joint media briefing held recently in Lagos to formally announce the unique loyalty campaign tagged &#8221;Rides and Rewards Promo&#8221;, the two companies together with other stakeholders present [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"om_disable_all_campaigns":false,"ngg_post_thumbnail":0},"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/755"}],"collection":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/comments?post=755"}],"version-history":[{"count":5,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/755\/revisions"}],"predecessor-version":[{"id":776,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/posts\/755\/revisions\/776"}],"wp:attachment":[{"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/media?parent=755"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/categories?post=755"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/coscharisgroup.net\/wp-json\/wp\/v2\/tags?post=755"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}